Desktop/AA/Week6/W6D5/cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE (1%) LIMIT $1  [["LIMIT", 1]]
---
    def index
        @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @kitty = Cat.find_by(id: params[:id])