Desktop/AA/Week6/W6D3/first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Tony"], ["email", "art@gmail.com"], ["created_at", "2020-06-17 20:30:31.202186"], ["updated_at", "2020-06-17 20:30:31.202186"]]
---
    def create

        @user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if @user.save