app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "bee"], ["LIMIT", 1]]
---
    def self.find_by_credentials(name, password)
        user = User.find_by(name: name)